; domain
(define (domain healthcare_basic)
    (:requirements :strips :typing)
    (:types
        medical_unit box supply robot patient - locatable
        robot_box robot_patient - robot
        location - object
    )

    (:predicates
        ; Location predicates
        (at ?o - locatable ?l - location)
        (connected ?l1 - location ?l2 - location)
        
        ; Box predicates
        (box_loaded_in_robot ?b - box ?r - robot_box)
        (box_unloaded ?b - box)
        (empty ?b - box)
        (box_has_supply ?b - box ?s - supply)
        
        ; Unit predicates
        (unit_needs_supply ?u - medical_unit ?s - supply)
        (unit_has_supply ?u - medical_unit ?s - supply)
        

        ; Patient predicates
        (patient_unloaded ?p - patient)
        (patient_loaded_in_robot ?p - patient ?r - robot_patient)
        (patient_needs_unit ?p - patient ?u - medical_unit)
        (patient_at_unit ?p - patient ?u - medical_unit)

        ; Robot predicates
        (robot_patient_empty ?r - robot_patient)
        (robot_box_empty ?r - robot_box)
    )
    
    ; === Supply operations ===

    ; Fill box with supply
    ; box is empty and unloaded and box, content and robot are at the same location
    (:action fill_box
        :parameters (?r - robot_box ?b - box ?l - location ?s - supply)
        :precondition (and
            (at ?r ?l)
            (at ?b ?l)
            (at ?s ?l)
            (box_unloaded ?b)
            (empty ?b)
        )
        :effect (and 
            (not (empty ?b))
            (box_has_supply ?b ?s)
        )
    )

    ; Deliver supply to unit
    ; causing the unit to have the supply and not need it anymore, and the box to be empty
    (:action deliver_supply
        :parameters (?r - robot_box ?b - box ?l - location ?s - supply ?u - medical_unit)
        :precondition (and
            (at ?r ?l)
            (at ?b ?l)
            (at ?u ?l)
            (box_has_supply ?b ?s)
            (box_unloaded ?b)
            (unit_needs_supply ?u ?s)           ; unit needs the supply
        )
        :effect (and
            (not (box_has_supply ?b ?s))
            (empty ?b)                          ; box is empty
            (not (unit_needs_supply ?u ?s))
            (unit_has_supply ?u ?s)             ; unit has the supply
        )
    )

    ; Load box 
    ; causing the box to be loaded in the robot and the robot to not be empty
    (:action load_box
        :parameters (?r - robot_box ?b - box ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?b ?l)
            (box_unloaded ?b)                   ; box is unloaded
            (robot_box_empty ?r)                ; robot is empty
        )
        :effect (and 
            (not (box_unloaded ?b))
            (box_loaded_in_robot ?b ?r)         ; box is loaded in the robot
            (not (robot_box_empty ?r))
        )
    )

    ; Unload box
    ; causing the box to be unloaded and the robot to be empty
    (:action unload_box
        :parameters (?r - robot_box ?b - box ?l - location)
        :precondition (and
            (at ?r ?l)
            (box_loaded_in_robot ?b ?r)
        )
        :effect (and 
            (box_unloaded ?b)                   ; box is unloaded  
            (not (box_loaded_in_robot ?b ?r))
            (robot_box_empty ?r)                ; robot is empty
            (at ?b ?l)
         )
    )

    ; Movement Boxes

    ; Move empty robot
    ; causing the update of the robot location
    (:action move_empty_robot_box
        :parameters (?r - robot_box ?l1 - location ?l2 - location)
        :precondition (and
            (at ?r ?l1)
            (connected ?l1 ?l2)                 ; check if the locations are connected
            (robot_box_empty ?r)
        )
        :effect (and 
            (not (at ?r ?l1))
            (at ?r ?l2)                         ; robot is at the new location   
        )
    )

    ; Move robot with box
    ; causing the update of both the box and the robot location
    (:action move_robot_with_box
        :parameters (?r - robot_box ?b - box ?l1 - location ?l2 - location)
        :precondition (and
            (at ?r ?l1)
            (connected ?l1 ?l2)
            (box_loaded_in_robot ?b ?r)
        )
        :effect (and 
            (not (at ?r ?l1))
            (not (at ?b ?l1))
            (at ?r ?l2)                         ; robot is at the new location
            (at ?b ?l2)                         ; box is at the new location
        )
    )

    ; === Patient operations ===

    ; Pick up patient
    ; causing the patient to be loaded in the robot and the robot to not be empty
    (:action pick_up_patient
        :parameters (?r - robot_patient ?p - patient ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?p ?l)
            (patient_unloaded ?p)               ; patient is unloaded
            (robot_patient_empty ?r)            ; robot is empty
        )
        :effect (and 
            (not (patient_unloaded ?p))
            (patient_loaded_in_robot ?p ?r)     ; patient is loaded in the robot
            (not (robot_patient_empty ?r))
        )
    )

    ; Drop off patient
    ; causing the patient to be unloaded and the robot to be empty 
    (:action drop_off_patient
        :parameters (?r - robot_patient ?p - patient ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?p ?l)
            (patient_loaded_in_robot ?p ?r)         ; patient is loaded in the robot
        )
        :effect (and 
            (patient_unloaded ?p)                   ; patient is unloaded
            (not (patient_loaded_in_robot ?p ?r))
            (robot_patient_empty ?r)                ; robot is empty
            (at ?p ?l)
         )
    )

    ; Deliver patient to unit
    ; causing the patient to be at the unit and not need it anymore
    (:action deliver_patient
        :parameters (?r - robot_patient ?p - patient ?l - location ?u - medical_unit)
        :precondition (and
            (at ?r ?l)
            (at ?p ?l)
            (at ?u ?l)

            (patient_unloaded ?p)
            (patient_needs_unit ?p ?u)          ; patient needs the unit
        )
        :effect (and
            (not (patient_needs_unit ?p ?u))
            (patient_at_unit ?p ?u)             ; patient is at the unit
        )
    )


    ; Movement Patients
    
    
    ; Move empty robot
    ; causing the update of the robot location
    (:action move_empty_robot_patient
        :parameters (?r - robot_patient ?l1 - location ?l2 - location)
        :precondition (and
            (at ?r ?l1)
            (connected ?l1 ?l2)             ; check if the locations are connected
            (robot_patient_empty ?r)
        )
        :effect (and 
            (not (at ?r ?l1))
            (at ?r ?l2)                     ; robot is at the new location
        )
    )

    ; Move robot with patient
    ; causing the update of both the patient and the robot location
    (:action move_robot_with_patient
        :parameters (?r - robot_patient ?p - patient ?l1 - location ?l2 - location)
        :precondition (and
            (at ?r ?l1)
            (connected ?l1 ?l2)
            (patient_loaded_in_robot ?p ?r)
        )
        :effect (and 
            (not (at ?r ?l1))
            (not (at ?p ?l1))
            (at ?r ?l2)                 ; robot is at the new location
            (at ?p ?l2)                 ; patient is at the new location
        )
    )
)

; problem
(define (problem healthcare_basic_p3_simple) 
    (:domain healthcare_basic)
    ; simple problem with multi robot and 2 patients and 2 units to test different planners
    (:objects
        entrance central_warehouse
        main_corridor
        emergency_area surgical_area 
        - location
        
        robot_box_1 robot_box_2 - robot_box
        
        robot_patient_1 robot_patient_2 - robot_patient
        
        box1 box2 - box
        
        scalpel aspirine - supply

        trauma_unit triage_unit operation_unit - medical_unit
        
        patient1 patient2 - patient
    )
    
    (:init
        ; Location connections 
        (connected central_warehouse main_corridor)
        (connected main_corridor central_warehouse)
        (connected entrance main_corridor)
        (connected main_corridor entrance)
        (connected main_corridor emergency_area)
        (connected emergency_area main_corridor)
        (connected main_corridor surgical_area)
        (connected surgical_area main_corridor)

        ; Initial locations
        ; two robotic agents allowed to carry boxes are located at the central_warehouse to deliver boxes
        (at robot_box_1 central_warehouse)  
        (at robot_box_2 central_warehouse) 
        ; two robotic agents allowed to accompany patients are initially located at the entrance
        (at robot_patient_1 entrance) 
        (at robot_patient_2 entrance) 
        ; Box locations: all boxes are located at a single location : central_warehouse
        (at box1 central_warehouse)
        (at box2 central_warehouse)
        ; Supplies location: all supplies are located at a single location : central_warehouse
        (at scalpel central_warehouse)
        (at aspirine central_warehouse)

        ; All the patients are at the entrance
        (at patient1 entrance)
        (at patient2 entrance)
        
        ; Medical units locations (no units are located at the central warehouse)
        (at trauma_unit emergency_area)
        (at triage_unit emergency_area)
        (at operation_unit surgical_area)

        ; Initial box states
        (box_unloaded box1)
        (box_unloaded box2)
        (empty box1)
        (empty box2)

        ; Initial robot states
        (robot_patient_empty robot_patient_1)
        (robot_box_empty robot_box_1)
        (robot_patient_empty robot_patient_2)
        (robot_box_empty robot_box_2)

        ; Initial patient states
        (patient_unloaded patient1)
        (patient_unloaded patient2)
        
        ; Supply needs
        (unit_needs_supply trauma_unit scalpel)
        (unit_needs_supply operation_unit aspirine)

        ; Patient needs
        (patient_needs_unit patient1 trauma_unit)
        (patient_needs_unit patient2 triage_unit)
    )
    
    (:goal
        (and
            ; All units should have their needed supplies
            (unit_has_supply trauma_unit scalpel)
            (unit_has_supply operation_unit aspirine)

            ; All patients should be at the medical unit
            (patient_at_unit patient1 trauma_unit)
            (patient_at_unit patient2 triage_unit)
        )
    )

    ; (:metric minimize (total-cost))
)

; plan
1. (fill_box robot_box_1 box1 central_warehouse aspirine)
   deleted: (empty box1)
   added: (box_has_supply box1 aspirine)
   goals met: 0 of 4
2. (pick_up_patient robot_patient_1 patient2 entrance)
   deleted: (patient_unloaded patient2) (robot_patient_empty robot_patient_1)
   added: (patient_loaded_in_robot patient2 robot_patient_1)
   goals met: 0 of 4
3. (move_robot_with_patient robot_patient_1 patient2 entrance main_corridor)
   deleted: (at robot_patient_1 entrance) (at patient2 entrance)
   added: (at robot_patient_1 main_corridor) (at patient2 main_corridor)
   goals met: 0 of 4
4. (move_robot_with_patient robot_patient_1 patient2 main_corridor emergency_area)
   deleted: (at robot_patient_1 main_corridor) (at patient2 main_corridor)
   added: (at robot_patient_1 emergency_area) (at patient2 emergency_area)
   goals met: 0 of 4
5. (drop_off_patient robot_patient_1 patient2 emergency_area)
   deleted: (patient_loaded_in_robot patient2 robot_patient_1)
   added: (patient_unloaded patient2) (robot_patient_empty robot_patient_1)
   goals met: 0 of 4
6. (deliver_patient robot_patient_1 patient2 emergency_area triage_unit)
   deleted: (patient_needs_unit patient2 triage_unit)
   added: (patient_at_unit patient2 triage_unit)
   goals met: 1 of 4
7. (fill_box robot_box_1 box2 central_warehouse scalpel)
   deleted: (empty box2)
   added: (box_has_supply box2 scalpel)
   goals met: 1 of 4
8. (load_box robot_box_2 box1 central_warehouse)
   deleted: (box_unloaded box1) (robot_box_empty robot_box_2)
   added: (box_loaded_in_robot box1 robot_box_2)
   goals met: 1 of 4
9. (move_robot_with_box robot_box_2 box1 central_warehouse main_corridor)
   deleted: (at robot_box_2 central_warehouse) (at box1 central_warehouse)
   added: (at robot_box_2 main_corridor) (at box1 main_corridor)
   goals met: 1 of 4
10. (load_box robot_box_1 box2 central_warehouse)
   deleted: (box_unloaded box2) (robot_box_empty robot_box_1)
   added: (box_loaded_in_robot box2 robot_box_1)
   goals met: 1 of 4
11. (move_robot_with_box robot_box_1 box2 central_warehouse main_corridor)
   deleted: (at robot_box_1 central_warehouse) (at box2 central_warehouse)
   added: (at robot_box_1 main_corridor) (at box2 main_corridor)
   goals met: 1 of 4
12. (pick_up_patient robot_patient_2 patient1 entrance)
   deleted: (patient_unloaded patient1) (robot_patient_empty robot_patient_2)
   added: (patient_loaded_in_robot patient1 robot_patient_2)
   goals met: 1 of 4
13. (move_robot_with_patient robot_patient_2 patient1 entrance main_corridor)
   deleted: (at robot_patient_2 entrance) (at patient1 entrance)
   added: (at robot_patient_2 main_corridor) (at patient1 main_corridor)
   goals met: 1 of 4
14. (move_robot_with_patient robot_patient_2 patient1 main_corridor emergency_area)
   deleted: (at robot_patient_2 main_corridor) (at patient1 main_corridor)
   added: (at robot_patient_2 emergency_area) (at patient1 emergency_area)
   goals met: 1 of 4
15. (drop_off_patient robot_patient_2 patient1 emergency_area)
   deleted: (patient_loaded_in_robot patient1 robot_patient_2)
   added: (patient_unloaded patient1) (robot_patient_empty robot_patient_2)
   goals met: 1 of 4
16. (deliver_patient robot_patient_1 patient1 emergency_area trauma_unit)
   deleted: (patient_needs_unit patient1 trauma_unit)
   added: (patient_at_unit patient1 trauma_unit)
   goals met: 2 of 4
17. (move_robot_with_box robot_box_2 box1 main_corridor surgical_area)
   deleted: (at robot_box_2 main_corridor) (at box1 main_corridor)
   added: (at robot_box_2 surgical_area) (at box1 surgical_area)
   goals met: 2 of 4
18. (unload_box robot_box_2 box1 surgical_area)
   deleted: (box_loaded_in_robot box1 robot_box_2)
   added: (box_unloaded box1) (robot_box_empty robot_box_2)
   goals met: 2 of 4
19. (deliver_supply robot_box_2 box1 surgical_area aspirine operation_unit)
   deleted: (box_has_supply box1 aspirine) (unit_needs_supply operation_unit aspirine)
   added: (empty box1) (unit_has_supply operation_unit aspirine)
   goals met: 3 of 4
20. (move_robot_with_box robot_box_1 box2 main_corridor emergency_area)
   deleted: (at robot_box_1 main_corridor) (at box2 main_corridor)
   added: (at robot_box_1 emergency_area) (at box2 emergency_area)
   goals met: 3 of 4
21. (unload_box robot_box_1 box2 emergency_area)
   deleted: (box_loaded_in_robot box2 robot_box_1)
   added: (box_unloaded box2) (robot_box_empty robot_box_1)
   goals met: 3 of 4
22. (deliver_supply robot_box_1 box2 emergency_area scalpel trauma_unit)
   deleted: (box_has_supply box2 scalpel) (unit_needs_supply trauma_unit scalpel)
   added: (empty box2) (unit_has_supply trauma_unit scalpel)
   goals met: 4 of 4
